/*

19. Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.

*/

Console.Clear();

System.Console.WriteLine("Введите число ");

int userNumber = Convert.ToInt32(Console.ReadLine());

if (userNumber.length < 5)
{
    System.Console.WriteLine(userNumber);
}

System.Console.WriteLine(userNumber);